src/DataProcessors/ДаннныеОДвиженииДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ДаннныеОДвиженииДенежныхСредств</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/ДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияДенежныхСредств</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ГрафикОбязательныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГрафикОбязательныхПлатежей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодичностьСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоДостиженияСуммы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСуммаКОплате</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОплатаОбязательныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОплатаОбязательныхПлатежей</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиПоДолгам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиПоДолгам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Финансовый</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипыСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСтатей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/УточнениеПериодичности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УточнениеПериодичности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РазВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Каждые</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПериодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ДаннныеОДвиженииДенежныхСредств/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 
	Период.ДатаНачала 		= НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания 	= КонецМесяца(ТекущаяДата());
	ОтборПоДолгам 			= "0";
	
	ОбновитьДанныеТЧ();
	ОбновитьДанныеДиаграмм();
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)   
	
	ОбновитьДанныеТЧ();
	ОбновитьДанныеДиаграмм();
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыеЦелиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ФинансовыеЦели.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено И ЗначениеЗаполнено(ТекущаяСтрока.Ссылка) Тогда
		ПоказатьЗначение(, ТекущаяСтрока.Ссылка);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОстаткиПоДолгамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ФинансовыеЦели.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено И ЗначениеЗаполнено(ТекущаяСтрока.Ссылка) Тогда
		ПоказатьЗначение(, ТекущаяСтрока.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДолгамПриИзменении(Элемент)
	
	УстановитьОтбор();
		
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ОбновитьДанныеТЧ();
	ОбновитьДанныеДиаграмм();   
	
КонецПроцедуры  

&НаКлиенте
Процедура ПровестиВыбранныеПлатежи(Команда)
	
	ПровестиВыбранныеПлатежиНаСервере();
	
	ОбновитьДанныеТЧ();
	ОбновитьДанныеДиаграмм();   
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ОбновитьДанныеДиаграмм()  
	
	ЗаполнитьДанныеДиаграммыОДоходах();  
	ЗаполнитьДанныеДиаграммыОРасходах();
	
КонецПроцедуры 

&НаКлиенте 
Процедура ОбновитьДанныеТЧ()  
	
	ЗаполнитьОстаткиПоСчетам();  
	ЗаполнитьГрафикОбязательныхПлатежей();
	ЗаполнитьФинансовыеЦели();
	ЗаполнитьДолги();
	УстановитьУсловноеОформлениеГрафика();
	РассчитатьОбщийОстатокВВалютеУчета();
	                                      
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДиаграммыОДоходах()  
	
    Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств.Наименование КАК ИсточникИнформации,
	|	ДвиженияДенежныхСредствОбороты.СуммаОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(&ДатаНачала, &ДатаОкончания, Период, СтатьяДвиженияДенежныхСредств.ТипСтатьи = &Доход) КАК ДвиженияДенежныхСредствОбороты";
	
	Запрос.УстановитьПараметр("ДатаНачала", 		Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		Период.ДатаОкончания);  
	
	Запрос.УстановитьПараметр("Доход", 				Перечисления.ТипыСтатей.Доход);
	
	ДанныеОДоходе.Обновление = Ложь;
	ДанныеОДоходе.Очистить();

	Точка = ДанныеОДоходе.Точки.Добавить("Сумма");
	Точка.Текст = "Сумма";
	Точка.ПриоритетЦвета = Ложь;

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

	    Серия = ДанныеОДоходе.Серии.Добавить(Выборка.ИсточникИнформации);
	    ДанныеОДоходе.УстановитьЗначение(Точка, Серия, Выборка.Сумма, Строка(Выборка.Сумма));

	КонецЦикла;

	ДанныеОДоходе.Обновление = Истина;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьДанныеДиаграммыОРасходах()  
	
    Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств.Наименование КАК ИсточникИнформации,
	|	ДвиженияДенежныхСредствОбороты.СуммаОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(&ДатаНачала, &ДатаОкончания, Период, СтатьяДвиженияДенежныхСредств.ТипСтатьи = &Расход) КАК ДвиженияДенежныхСредствОбороты";
	
	Запрос.УстановитьПараметр("ДатаНачала", 		Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		Период.ДатаОкончания);  
	
	Запрос.УстановитьПараметр("Расход", 			Перечисления.ТипыСтатей.Расход);
	
	ДанныеОРасходе.Обновление = Ложь;
	ДанныеОРасходе.Очистить();

	Точка = ДанныеОРасходе.Точки.Добавить("Сумма");
	Точка.Текст = "Сумма";
	Точка.ПриоритетЦвета = Ложь;

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

	    Серия = ДанныеОРасходе.Серии.Добавить(Выборка.ИсточникИнформации);
	    ДанныеОРасходе.УстановитьЗначение(Точка, Серия, Выборка.Сумма, Строка(Выборка.Сумма));

	КонецЦикла;

	ДанныеОРасходе.Обновление = Истина;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьОстаткиПоСчетам()  
	
    Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиДенежныхСредствОстатки.Кошелек КАК Счет,
	|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК Сумма,
	|	ОстаткиДенежныхСредствОстатки.Кошелек.Валюта КАК Валюта
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&ДатаОкончания, ) КАК ОстаткиДенежныхСредствОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сумма УБЫВ";
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания); 
	
	ОстаткиПоСчетам.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьГрафикОбязательныхПлатежей()  
	
    Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГрафикОбязательныхПлатежейСрезПоследних.Регистратор КАК ГрафикПлатежей,
	|	ГрафикОбязательныхПлатежейСрезПоследних.Регистратор.Счет КАК Кошелек,
	|	ГрафикОбязательныхПлатежейСрезПоследних.Регистратор.СтатьяРасхода КАК СтатьяРасхода,
	|	ГрафикОбязательныхПлатежейСрезПоследних.Регистратор.Контрагент КАК Контрагент,
	|	ГрафикОбязательныхПлатежейСрезПоследних.ПредметПлатежа КАК ПредметПлатежа,
	|	ГрафикОбязательныхПлатежейСрезПоследних.Периодичность КАК Периодичность,
	|	ГрафикОбязательныхПлатежейСрезПоследних.Сумма КАК Сумма,
	|	ГрафикОбязательныхПлатежейСрезПоследних.ДоДостиженияСуммы КАК ДоДостиженияСуммы,
	|	ГрафикОбязательныхПлатежейСрезПоследних.ОбщаяСуммаКОплате КАК ОбщаяСуммаКОплате,
	|	ГрафикОбязательныхПлатежейСрезПоследних.Период КАК ДатаНазначенияПлатежа
	|ПОМЕСТИТЬ втДанныеКОплате
	|ИЗ
	|	РегистрСведений.ГрафикОбязательныхПлатежей.СрезПоследних(&ДатаОкончания, ) КАК ГрафикОбязательныхПлатежейСрезПоследних
	|ГДЕ
	|	(ГрафикОбязательныхПлатежейСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ ГрафикОбязательныхПлатежейСрезПоследних.ДатаОкончания >= &ДатаНачала)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеКОплате.ПредметПлатежа КАК ПредметПлатежа,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОплатаОбязательныхПлатежей.Период ЕСТЬ NULL
	|				ТОГДА втДанныеКОплате.ДатаНазначенияПлатежа
	|			ИНАЧЕ ОплатаОбязательныхПлатежей.Период
	|		КОНЕЦ) КАК ДатаПоследнегоПлатежа,
	|	СУММА(ОплатаОбязательныхПлатежей.Сумма) КАК ОбщаяСуммаПлатежа
	|ПОМЕСТИТЬ втДанныеОПредыдущихОплатах
	|ИЗ
	|	втДанныеКОплате КАК втДанныеКОплате
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОплатаОбязательныхПлатежей КАК ОплатаОбязательныхПлатежей
	|		ПО втДанныеКОплате.ПредметПлатежа = ОплатаОбязательныхПлатежей.ПредметПлатежа
	|
	|СГРУППИРОВАТЬ ПО
	|	втДанныеКОплате.ПредметПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеКОплате.Контрагент КАК Контрагент,
	|	втДанныеКОплате.Кошелек КАК Кошелек,
	|	втДанныеКОплате.СтатьяРасхода КАК СтатьяРасхода,
	|	втДанныеКОплате.ГрафикПлатежей КАК ГрафикПлатежей,
	|	втДанныеКОплате.ПредметПлатежа КАК ПредметПлатежа,
	|	ВЫБОР
	|		КОГДА втДанныеКОплате.Периодичность.Уточнение = ЗНАЧЕНИЕ(Перечисление.УточнениеПериодичности.Каждые)
	|			ТОГДА ВЫБОР
	|					КОГДА втДанныеКОплате.Периодичность.ТипПериодов = ЗНАЧЕНИЕ(Перечисление.ТипыПериодов.День)
	|						ТОГДА ДОБАВИТЬКДАТЕ(втДанныеОПредыдущихОплатах.ДатаПоследнегоПлатежа, ДЕНЬ, втДанныеКОплате.Периодичность.ЧислоПериодов)
	|					КОГДА втДанныеКОплате.Периодичность.ТипПериодов = ЗНАЧЕНИЕ(Перечисление.ТипыПериодов.НЕДЕЛЯ)
	|						ТОГДА ДОБАВИТЬКДАТЕ(втДанныеОПредыдущихОплатах.ДатаПоследнегоПлатежа, НЕДЕЛЯ, втДанныеКОплате.Периодичность.ЧислоПериодов)
	|					КОГДА втДанныеКОплате.Периодичность.ТипПериодов = ЗНАЧЕНИЕ(Перечисление.ТипыПериодов.МЕСЯЦ)
	|						ТОГДА ДОБАВИТЬКДАТЕ(втДанныеОПредыдущихОплатах.ДатаПоследнегоПлатежа, МЕСЯЦ, втДанныеКОплате.Периодичность.ЧислоПериодов)
	|					КОГДА втДанныеКОплате.Периодичность.ТипПериодов = ЗНАЧЕНИЕ(Перечисление.ТипыПериодов.Квартал)
	|						ТОГДА ДОБАВИТЬКДАТЕ(втДанныеОПредыдущихОплатах.ДатаПоследнегоПлатежа, КВАРТАЛ, втДанныеКОплате.Периодичность.ЧислоПериодов)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(втДанныеОПредыдущихОплатах.ДатаПоследнегоПлатежа, ГОД, втДанныеКОплате.Периодичность.ЧислоПериодов)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА втДанныеКОплате.Периодичность.ТипПериодов = ЗНАЧЕНИЕ(Перечисление.ТипыПериодов.День)
	|					ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(втДанныеОПредыдущихОплатах.ДатаПоследнегоПлатежа, ДЕНЬ, втДанныеКОплате.Периодичность.ЧислоПериодов), ДЕНЬ)
	|				КОГДА втДанныеКОплате.Периодичность.ТипПериодов = ЗНАЧЕНИЕ(Перечисление.ТипыПериодов.НЕДЕЛЯ)
	|					ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(втДанныеОПредыдущихОплатах.ДатаПоследнегоПлатежа, НЕДЕЛЯ, втДанныеКОплате.Периодичность.ЧислоПериодов), НЕДЕЛЯ)
	|				КОГДА втДанныеКОплате.Периодичность.ТипПериодов = ЗНАЧЕНИЕ(Перечисление.ТипыПериодов.МЕСЯЦ)
	|					ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(втДанныеОПредыдущихОплатах.ДатаПоследнегоПлатежа, МЕСЯЦ, втДанныеКОплате.Периодичность.ЧислоПериодов), МЕСЯЦ)
	|				КОГДА втДанныеКОплате.Периодичность.ТипПериодов = ЗНАЧЕНИЕ(Перечисление.ТипыПериодов.Квартал)
	|					ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(втДанныеОПредыдущихОплатах.ДатаПоследнегоПлатежа, КВАРТАЛ, втДанныеКОплате.Периодичность.ЧислоПериодов), КВАРТАЛ)
	|				ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(втДанныеОПредыдущихОплатах.ДатаПоследнегоПлатежа, ГОД, втДанныеКОплате.Периодичность.ЧислоПериодов), ГОД)
	|			КОНЕЦ
	|	КОНЕЦ КАК ПлановаяДата,
	|	ВЫБОР
	|		КОГДА втДанныеКОплате.ДоДостиженияСуммы
	|			ТОГДА втДанныеКОплате.Сумма
	|		ИНАЧЕ втДанныеКОплате.Сумма
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ втПредварительная
	|ИЗ
	|	втДанныеКОплате КАК втДанныеКОплате
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеОПредыдущихОплатах КАК втДанныеОПредыдущихОплатах
	|		ПО втДанныеКОплате.ПредметПлатежа = втДанныеОПредыдущихОплатах.ПредметПлатежа
	|ГДЕ
	|	ВЫБОР
	|			КОГДА втДанныеКОплате.ДоДостиженияСуммы
	|				ТОГДА втДанныеКОплате.ОбщаяСуммаКОплате > втДанныеОПредыдущихОплатах.ОбщаяСуммаПлатежа
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредварительная.Контрагент КАК Контрагент,
	|	втПредварительная.Кошелек КАК Кошелек,
	|	втПредварительная.СтатьяРасхода КАК СтатьяРасхода,
	|	втПредварительная.ГрафикПлатежей КАК ГрафикПлатежей,
	|	втПредварительная.ПредметПлатежа КАК ПредметПлатежа,
	|	втПредварительная.ПлановаяДата КАК ПлановаяДата,
	|	втПредварительная.Сумма КАК Сумма
	|ИЗ
	|	втПредварительная КАК втПредварительная
	|ГДЕ
	|	втПредварительная.ПлановаяДата <= &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала", 		Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		Период.ДатаОкончания); 
	
	ГрафикОбязательныхПлатежей.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры    

&НаСервере
Процедура ПровестиВыбранныеПлатежиНаСервере()  
	
	СтруктураОтбора = Новый Структура("Выбрать", Истина);
	
	СтрокиДляПроведения = ГрафикОбязательныхПлатежей.НайтиСтроки(СтруктураОтбора);
	
	Для Каждого СтрокаДляПроведения Из СтрокиДляПроведения Цикл 
		
		ДокументОбъект = Документы.Расход.СоздатьДокумент();
		
		ДокументОбъект.Дата = ТекущаяДата();    
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДляПроведения); 
		
		ДокументОбъект.Комментарий = СтрШаблон("Создан автоматически из обработки %1", ТекущаяДата());    
		
		Попытка
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьУсловноеОформлениеГрафика()

	ГраницаСегодня = НачалоДня(ТекущаяДата());
	ГраницаЧерезНеделю = КонецДня(ТекущаяДата() + 86400*7);
	
	Оформление = ЭтаФорма.УсловноеОформление;
	Оформление.Элементы.Очистить();
	
	// Для ТЧ Графика обязательных платяжей
	// Просрочено
	ОформлениеПросрочки = Оформление.Элементы.Добавить();
	ОформлениеПросрочки.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,221,221));
	
	Отбор = ОформлениеПросрочки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГрафикОбязательныхПлатежей.ПлановаяДата");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	Отбор.ПравоеЗначение = ГраницаСегодня;
	Отбор.Использование = Истина;
	
	ПрименитьКТаблице = ОформлениеПросрочки.Поля.Элементы.Добавить();
	ПрименитьКТаблице.Поле = Новый ПолеКомпоновкиДанных("ГрафикОбязательныхПлатежей");
	
	// Осталось меньше 7 дней
	ОформлениеБлижайших = Оформление.Элементы.Добавить();
	ОформлениеБлижайших.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 243, 205));
	
	УсловиеНачалоПериода = ОформлениеБлижайших.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеНачалоПериода.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГрафикОбязательныхПлатежей.ПлановаяДата");
	УсловиеНачалоПериода.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	УсловиеНачалоПериода.ПравоеЗначение = ГраницаСегодня; 
	УсловиеНачалоПериода.Использование = Истина;
	
	УсловиеКонецПериода = ОформлениеБлижайших.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеКонецПериода.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ГрафикОбязательныхПлатежей.ПлановаяДата");
	УсловиеКонецПериода.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	УсловиеКонецПериода.ПравоеЗначение = ГраницаЧерезНеделю;
	УсловиеКонецПериода.Использование = Истина;
	
	ПрименитьКТаблицеБлижайших = ОформлениеБлижайших.Поля.Элементы.Добавить();
	ПрименитьКТаблицеБлижайших.Поле = Новый ПолеКомпоновкиДанных("ГрафикОбязательныхПлатежей");
	
	// Для ТЧ Финансовые цели
	// Меньше 30% — красный 
	ОформлениеНизкийПроцент = УсловноеОформление.Элементы.Добавить();
    ОформлениеНизкийПроцент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
	ОформлениеНизкийПроцент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
    
    УсловиеНизкийПроцент = ОформлениеНизкийПроцент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    УсловиеНизкийПроцент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФинансовыеЦели.ПроцентВыполнения");
    УсловиеНизкийПроцент.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
    УсловиеНизкийПроцент.ПравоеЗначение = 30;
    УсловиеНизкийПроцент.Использование = Истина;
    
    ПолеНизкийПроцент = ОформлениеНизкийПроцент.Поля.Элементы.Добавить();
    ПолеНизкийПроцент.Поле = Новый ПолеКомпоновкиДанных("ФинансовыеЦелиПроцентВыполнения");
    
    // От 30 до 90% - желтый                
    ОформлениеСреднийПроцент = УсловноеОформление.Элементы.Добавить();
    ОформлениеСреднийПроцент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(170, 90, 0)); 
	ОформлениеСреднийПроцент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
    
    УсловиеСреднийОт = ОформлениеСреднийПроцент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    УсловиеСреднийОт.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФинансовыеЦели.ПроцентВыполнения");
    УсловиеСреднийОт.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    УсловиеСреднийОт.ПравоеЗначение = 30;
    УсловиеСреднийОт.Использование = Истина;
    
    УсловиеСреднийДо = ОформлениеСреднийПроцент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    УсловиеСреднийДо.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФинансовыеЦели.ПроцентВыполнения");
    УсловиеСреднийДо.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
    УсловиеСреднийДо.ПравоеЗначение = 90;
    УсловиеСреднийДо.Использование = Истина;
    
    ПолеСреднийПроцент = ОформлениеСреднийПроцент.Поля.Элементы.Добавить();
    ПолеСреднийПроцент.Поле = Новый ПолеКомпоновкиДанных("ФинансовыеЦелиПроцентВыполнения");
    
    //  Больше 90% - зеленый     
    ОформлениеДостигнуто = УсловноеОформление.Элементы.Добавить();
    ОформлениеДостигнуто.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 128, 0));
	ОформлениеДостигнуто.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
    
    УсловиеДостигнуто = ОформлениеДостигнуто.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    УсловиеДостигнуто.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФинансовыеЦели.ПроцентВыполнения");
    УсловиеДостигнуто.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    УсловиеДостигнуто.ПравоеЗначение = 90;
    УсловиеДостигнуто.Использование = Истина;
    
    ПолеДостигнуто = ОформлениеДостигнуто.Поля.Элементы.Добавить();
    ПолеДостигнуто.Поле = Новый ПолеКомпоновкиДанных("ФинансовыеЦелиПроцентВыполнения"); 
	
	//Для ТЧ ОстаткиПоДолгам
	//Меньше 30% — красный	
	ОформлениеНизкийПроцентДолга = УсловноеОформление.Элементы.Добавить();
    ОформлениеНизкийПроцентДолга.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
	ОформлениеНизкийПроцентДолга.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
    
    УсловиеНизкийПроцентДолга = ОформлениеНизкийПроцентДолга.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    УсловиеНизкийПроцентДолга.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОстаткиПоДолгам.ПроцентВыполнения");
    УсловиеНизкийПроцентДолга.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
    УсловиеНизкийПроцентДолга.ПравоеЗначение = 30;
    УсловиеНизкийПроцентДолга.Использование = Истина;
    
    ПолеНизкийПроцентДолга = ОформлениеНизкийПроцентДолга.Поля.Элементы.Добавить();
    ПолеНизкийПроцентДолга.Поле = Новый ПолеКомпоновкиДанных("ОстаткиПоДолгамПроцентВыполнения");
    
    // От 30 до 90% - желтый                
    ОформлениеСреднийПроцентДолга = УсловноеОформление.Элементы.Добавить();
    ОформлениеСреднийПроцентДолга.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(170, 90, 0)); 
	ОформлениеСреднийПроцентДолга.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
    
    УсловиеСреднийПроцентДолгаОт = ОформлениеСреднийПроцентДолга.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    УсловиеСреднийПроцентДолгаОт.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОстаткиПоДолгам.ПроцентВыполнения");
    УсловиеСреднийПроцентДолгаОт.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    УсловиеСреднийПроцентДолгаОт.ПравоеЗначение = 30;
    УсловиеСреднийПроцентДолгаОт.Использование = Истина;
    
    УсловиеСреднийПроцентДолгаДо = ОформлениеСреднийПроцентДолга.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    УсловиеСреднийПроцентДолгаДо.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОстаткиПоДолгам.ПроцентВыполнения");
    УсловиеСреднийПроцентДолгаДо.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
    УсловиеСреднийПроцентДолгаДо.ПравоеЗначение = 90;
    УсловиеСреднийПроцентДолгаДо.Использование = Истина;
    
    ПолеСреднийПроцентДолга = ОформлениеСреднийПроцентДолга.Поля.Элементы.Добавить();
    ПолеСреднийПроцентДолга.Поле = Новый ПолеКомпоновкиДанных("ОстаткиПоДолгамПроцентВыполнения");
    
    //  Больше 90% - зеленый     
    ОформлениеДолгаДостигнуто = УсловноеОформление.Элементы.Добавить();
    ОформлениеДолгаДостигнуто.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 128, 0));
	ОформлениеДолгаДостигнуто.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
    
    УсловиеДолгаДостигнуто = ОформлениеДолгаДостигнуто.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    УсловиеДолгаДостигнуто.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОстаткиПоДолгам.ПроцентВыполнения");
    УсловиеДолгаДостигнуто.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    УсловиеДолгаДостигнуто.ПравоеЗначение = 90;
    УсловиеДолгаДостигнуто.Использование = Истина;
    
    ПолеДолгаДостигнуто = ОформлениеДолгаДостигнуто.Поля.Элементы.Добавить();
    ПолеДолгаДостигнуто.Поле = Новый ПолеКомпоновкиДанных("ОстаткиПоДолгамПроцентВыполнения");
	
		
КонецПроцедуры

&НаСервере
Процедура РассчитатьОбщийОстатокВВалютеУчета()
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ОстаткиДенежныхСредствОстатки.Кошелек.Валюта КАК Валюта,
	 |	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК Сумма,
	 |	ВЫБОР
	 |		КОГДА КурсыВалютСрезПоследних.Курс ЕСТЬ NULL
	 |			ТОГДА 1
	 |		ИНАЧЕ КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	 |	КОНЕЦ КАК Коэффициент
	 |ПОМЕСТИТЬ вт_Предварительная
	 |ИЗ
	 |	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&ДатаОкончания, ) КАК ОстаткиДенежныхСредствОстатки
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОкончания, ) КАК КурсыВалютСрезПоследних
	 |		ПО ОстаткиДенежныхСредствОстатки.Кошелек.Валюта = КурсыВалютСрезПоследних.Валюта
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	вт_Предварительная.Валюта КАК Валюта,
	 |	вт_Предварительная.Сумма * вт_Предварительная.Коэффициент КАК Сумма
	 |ИЗ
	 |	вт_Предварительная КАК вт_Предварительная";
	 Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 ОбщийОстаток = 0;
	 
	 Пока Выборка.Следующий() Цикл
		 
		ОбщийОстаток = ОбщийОстаток + Выборка.Сумма;
			 
	 КонецЦикла;	
	
 КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФинансовыеЦели()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФинансовыеЦели.Ссылка КАК Ссылка,
	|	ФинансовыеЦели.Наименование КАК Наименование,
	|	ФинансовыеЦели.ЦелеваяСумма КАК ЦелеваяСумма,
	|	ФинансовыеЦели.СрокДостижения КАК СрокДостижения,
	|	ЕСТЬNULL(ОстаткиДенежныхСредствОстатки.СуммаОстаток, 0) КАК ТекущийОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиДенежныхСредствОстатки.СуммаОстаток, 0) / ФинансовыеЦели.ЦелеваяСумма * 100 > 100
	|			ТОГДА 100
	|		ИНАЧЕ ЕСТЬNULL(ОстаткиДенежныхСредствОстатки.СуммаОстаток, 0) / ФинансовыеЦели.ЦелеваяСумма * 100
	|	КОНЕЦ КАК ПроцентВыполнения
	|ИЗ
	|	Справочник.ФинансовыеЦели КАК ФинансовыеЦели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&ДатаОкончания, Кошелек.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетов.Накопительный)) КАК ОстаткиДенежныхСредствОстатки
	|		ПО ФинансовыеЦели.СвязанныйСчет = ОстаткиДенежныхСредствОстатки.Кошелек
	|ГДЕ
	|	ФинансовыеЦели.Статус = &Статус";
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЦелей.Активна);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
 
    РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	ФинансовыеЦели.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДолги()
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Долги.Ссылка КАК Ссылка,
	 |	Долги.Наименование КАК Наименование,
	 |	Долги.СуммаДолга КАК СуммаДолга,
	 |	Долги.СрокВозврата КАК СрокВозврата,
	 |	Долги.Статус КАК СтатусДолга,
	 |	ВЫБОР
	 |		КОГДА (Долги.СуммаДолга - ЕСТЬNULL(ОстаткиПоДолгамОстатки.СуммаОстаток, 0)) / Долги.СуммаДолга * 100 > 100
	 |			ТОГДА 100
	 |		ИНАЧЕ (Долги.СуммаДолга - ЕСТЬNULL(ОстаткиПоДолгамОстатки.СуммаОстаток, 0)) / Долги.СуммаДолга * 100
	 |	КОНЕЦ КАК ПроцентВыполнения,
	 |	ОстаткиПоДолгамОстатки.СуммаОстаток КАК ТекущийОстаток,
	 |	Долги.НаправлениеДолга КАК НаправлениеДолга
	 |ИЗ
	 |	Справочник.Долги КАК Долги
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПоДолгам.Остатки(&ДатаОкончания, ) КАК ОстаткиПоДолгамОстатки
	 |		ПО (ОстаткиПоДолгамОстатки.Долг = Долги.Ссылка)";
	 Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	 
	 РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	 
	 ОстаткиПоДолгам.Загрузить(РезультатЗапроса);
	 
КонецПроцедуры 

&НаСервере 
Процедура УстановитьОтбор()
	
	Если ОтборПоДолгам = "0" Тогда
		
		Элементы.ОстаткиПоДолгам.ОтборСтрок = Новый ФиксированнаяСтруктура();
		
	ИначеЕсли ОтборПоДолгам = "1" Тогда
		
		ЗначениеОтбора = Перечисления.НаправлениеДолга.НамДолжны;
		Элементы.ОстаткиПоДолгам.ОтборСтрок = Новый ФиксированнаяСтруктура("НаправлениеДолга", ЗначениеОтбора);
		
	ИначеЕсли ОтборПоДолгам = "2" Тогда
		
		ЗначениеОтбора = Перечисления.НаправлениеДолга.МыДолжны; 
		Элементы.ОстаткиПоДолгам.ОтборСтрок = Новый ФиксированнаяСтруктура("НаправлениеДолга", ЗначениеОтбора);
		
	КонецЕсли;

КонецПроцедуры


#КонецОбласти
